<!DOCTYPE html><html><head><meta charset='UTF-8'><title>BattleCardMovement.cs - 詳細</title><link rel='stylesheet' href='../styles.css'></head><body><div class='container'><div class='nav-bar'><a href='../index.html'>&lt; トップページへ戻る</a> | <span>File: BattleCardMovement.cs</span></div><div style='background:#666; color:white; padding:10px 15px; border-radius:5px; margin-bottom:20px;'>File Path: <span style='opacity:0.8'>Assets/Scripts/BattleCardMovement.cs</span></div><div id='BattleCardMovement' style='border:1px solid #ccc; border-top:none; padding:20px; background:white; margin-bottom:40px; border-radius:5px;'><h3><span><span class='tag tag-cls'>Class</span> BattleCardMovement <span style='color:#7f8c8d; font-weight:normal; font-size:0.9em;'>: MonoBehaviour, IBeginDragHandler, IDragHandler, IEndDragHandler</span></span><span style='font-size:0.8em; font-weight:normal; color:#666;'>(Global)</span></h3><div class='desc-box'>&#12496;&#12488;&#12523;&#12471;&#12540;&#12531;&#12395;&#12362;&#12369;&#12427;&#12459;&#12540;&#12489;&#12398;&#31227;&#21205;&#21046;&#24481;&#65288;&#12489;&#12521;&#12483;&#12464;&#65286;&#12489;&#12525;&#12483;&#12503;&#12289;&#25915;&#25731;&#12514;&#12540;&#12471;&#12519;&#12531;&#65289;&#12434;&#34892;&#12358;&#12463;&#12521;&#12473;<br/>&#12510;&#12454;&#12473;&#25805;&#20316;&#12398;&#12463;&#12521;&#12473;&#21517;</div><h4>フィールド (Variables)</h4><table><thead><tr><th>アクセス</th><th>名前</th><th>型</th><th>説明</th><th>属性・制約</th></tr></thead><tbody><tr><td class='center'><span class='acc acc-public'>public</span></td><td><b>cardParent</b></td><td class='center'><code>Transform</code></td><td>&#12459;&#12540;&#12489;&#12364;&#26412;&#26469;&#25152;&#23646;&#12375;&#12390;&#12356;&#12427;&#35242;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#65288;&#12501;&#12451;&#12540;&#12523;&#12489;&#12420;&#25163;&#26413;&#12456;&#12522;&#12450;&#12394;&#12393;&#65289;</td><td class='center'></td></tr><tr><td class='center'><span class='acc acc-private'>private</span></td><td><b>canDrag</b></td><td class='center'><code>Boolean</code></td><td>&#12459;&#12540;&#12489;&#12434;&#12489;&#12521;&#12483;&#12464;&#25805;&#20316;&#12391;&#12365;&#12427;&#12363;&#12393;&#12358;&#12363;&#12398;&#12501;&#12521;&#12464;</td><td class='center'></td></tr><tr><td class='center'><span class='acc acc-private'>private</span></td><td><b>oriCardParent</b></td><td class='center'><code>Transform</code></td><td>&#12489;&#12521;&#12483;&#12464;&#38283;&#22987;&#21069;&#12398;&#35242;&#12458;&#12502;&#12472;&#12455;&#12463;&#12488;&#12434;&#19968;&#26178;&#20445;&#23384;&#12377;&#12427;&#22793;&#25968;</td><td class='center'></td></tr><tr><td class='center'><span class='acc acc-private'>private</span></td><td><b>cardIndex</b></td><td class='center'><code>Int32</code></td><td>&#12489;&#12521;&#12483;&#12464;&#38283;&#22987;&#21069;&#12398;&#20804;&#24351;&#38918;&#65288;&#25551;&#30011;&#38918;&#65289;&#12434;&#20445;&#23384;&#12377;&#12427;&#22793;&#25968;</td><td class='center'></td></tr><tr><td class='center'><span class='acc acc-private'>private</span></td><td><b>playercardposition</b></td><td class='center'><code>Vector3</code></td><td>&#12503;&#12524;&#12452;&#12516;&#12540;&#12459;&#12540;&#12489;&#12398;&#21021;&#26399;&#20301;&#32622;&#65288;&#25915;&#25731;&#12514;&#12540;&#12471;&#12519;&#12531;&#26178;&#12398;&#25147;&#12426;&#20301;&#32622;&#12392;&#12375;&#12390;&#20351;&#29992;&#65289;</td><td class='center'></td></tr></tbody></table><h4>メソッド (Methods)</h4><table><thead><tr><th>アクセス</th><th>名前</th><th>引数</th><th>戻り値</th><th>説明</th></tr></thead><tbody><tr><td class='center'><span class='acc acc-public'>public</span></td><td><b>OnBeginDrag</b></td><td><small>PointerEventData eventData</small></td><td class='center'><code>Void</code></td><td>&#12489;&#12521;&#12483;&#12464;&#38283;&#22987;&#26178;&#12398;&#20966;&#29702;
&#12489;&#12521;&#12483;&#12464;&#12434;&#22987;&#12417;&#12427;&#12392;&#12365;&#12395;&#34892;&#12358;&#20966;&#29702;</td></tr><tr><td class='center'><span class='acc acc-public'>public</span></td><td><b>OnDrag</b></td><td><small>PointerEventData eventData</small></td><td class='center'><code>Void</code></td><td>&#12489;&#12521;&#12483;&#12464;&#25805;&#20316;&#20013;&#12395;&#27598;&#12501;&#12524;&#12540;&#12512;&#21628;&#12400;&#12428;&#12427;&#12513;&#12477;&#12483;&#12489;&#12290;
&#12459;&#12540;&#12489;&#12398;&#20301;&#32622;&#12434;&#12510;&#12454;&#12473;&#12459;&#12540;&#12477;&#12523;&#65288;&#12479;&#12483;&#12481;&#20301;&#32622;&#65289;&#12395;&#36861;&#24467;&#12373;&#12379;&#12427;&#12290;
&#12489;&#12521;&#12483;&#12464;&#12375;&#12383;&#26178;&#12395;&#36215;&#12371;&#12377;&#20966;&#29702;</td></tr><tr><td class='center'><span class='acc acc-public'>public</span></td><td><b>OnEndDrag</b></td><td><small>PointerEventData eventData</small></td><td class='center'><code>Void</code></td><td>&#12489;&#12521;&#12483;&#12464;&#25805;&#20316;&#12364;&#32066;&#20102;&#12375;&#12383;&#65288;&#25351;&#12434;&#38626;&#12375;&#12383;&#65289;&#30636;&#38291;&#12395;&#21628;&#12400;&#12428;&#12427;&#12513;&#12477;&#12483;&#12489;&#12290;
&#12489;&#12525;&#12483;&#12503;&#20966;&#29702;&#12364;&#25104;&#21151;&#12375;&#12394;&#12363;&#12387;&#12383;&#22580;&#21512;&#12394;&#12393;&#12395;&#12289;&#12459;&#12540;&#12489;&#12434;&#20803;&#12398;&#20301;&#32622;&#12395;&#25147;&#12377;&#20966;&#29702;&#12434;&#34892;&#12358;&#12290;
&#12459;&#12540;&#12489;&#12434;&#38626;&#12375;&#12383;&#12392;&#12365;&#12395;&#34892;&#12358;&#20966;&#29702;</td></tr><tr><td class='center'><span class='acc acc-public'>public</span></td><td><b>AttackMotion</b></td><td><small>Transform target</small></td><td class='center'><code>IEnumerator</code></td><td>&#25973;&#12459;&#12540;&#12489;&#12364;&#25915;&#25731;&#12434;&#34892;&#12358;&#38555;&#12398;&#12450;&#12491;&#12513;&#12540;&#12471;&#12519;&#12531;&#20966;&#29702;&#12290;
&#12479;&#12540;&#12466;&#12483;&#12488;&#12395;&#21521;&#12363;&#12387;&#12390;&#31227;&#21205;&#12375;&#12289;&#25915;&#25731;&#24460;&#12395;&#20803;&#12398;&#20301;&#32622;&#12395;&#25147;&#12427;&#21205;&#12365;&#12434;&#28436;&#20986;&#12377;&#12427;&#12290;
&#25973;&#12459;&#12540;&#12489;&#20596;</td></tr><tr><td class='center'><span class='acc acc-public'>public</span></td><td><b>PlayerAttackMotion</b></td><td><small>Transform target</small></td><td class='center'><code>IEnumerator</code></td><td>&#12503;&#12524;&#12452;&#12516;&#12540;&#20596;&#12398;&#12459;&#12540;&#12489;&#12364;&#25915;&#25731;&#12434;&#34892;&#12358;&#38555;&#12398;&#12450;&#12491;&#12513;&#12540;&#12471;&#12519;&#12531;&#20966;&#29702;&#12290;
&#12489;&#12521;&#12483;&#12464;&#25805;&#20316;&#24460;&#12398;&#20301;&#32622;&#12474;&#12524;&#12434;&#38450;&#12368;&#12383;&#12417;&#12398;&#35036;&#27491;&#12364;&#21547;&#12414;&#12428;&#12390;&#12356;&#12427;&#12496;&#12540;&#12472;&#12519;&#12531;&#12290;
&#12496;&#12464;&#20462;&#27491;&#12398;&#12383;&#12417;&#12398;&#12503;&#12524;&#12452;&#12516;&#12540;&#20596;&#12398;</td></tr><tr><td class='center'><span class='acc acc-public'>public</span></td><td><b>SummonMotion</b></td><td><small></small></td><td class='center'><code>IEnumerator</code></td><td>&#12459;&#12540;&#12489;&#12364;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#21484;&#21914;&#12373;&#12428;&#12383;&#26178;&#12398;&#30331;&#22580;&#12450;&#12491;&#12513;&#12540;&#12471;&#12519;&#12531;&#12290;
&#19968;&#30636;&#25313;&#22823;&#12375;&#12390;&#12363;&#12425;&#20803;&#12398;&#12469;&#12452;&#12474;&#12395;&#25147;&#12427;&#12371;&#12392;&#12391;&#12300;&#12509;&#12531;&#12483;&#12301;&#12392;&#20986;&#12383;&#12424;&#12358;&#12394;&#28436;&#20986;&#12434;&#34892;&#12358;&#12290;</td></tr><tr><td class='center'><span class='acc acc-public'>public</span></td><td><b>UseSpellMotion</b></td><td><small></small></td><td class='center'><code>IEnumerator</code></td><td>&#12473;&#12506;&#12523;&#12459;&#12540;&#12489;&#12434;&#20351;&#29992;&#12375;&#12383;&#38555;&#12398;&#12450;&#12491;&#12513;&#12540;&#12471;&#12519;&#12531;&#12290;
&#22823;&#12365;&#12367;&#25313;&#22823;&#12375;&#12390;&#24375;&#35519;&#34920;&#31034;&#12375;&#12383;&#24460;&#12289;&#28040;&#28357;&#12377;&#12427;&#28436;&#20986;&#12434;&#34892;&#12358;&#12290;</td></tr></tbody></table></div></div></body></html>